# Merging Data Sets Together for Easy Analysis on Python

Import the pandas library

In [1]:
import pandas as pd

Import the various data sets to be used

In [2]:
df1 = pd.read_csv("C:/Users/Miracle/Downloads/Data Assignment - Associate ABC.csv")
df2 = pd.read_csv("C:/Users/Miracle/Downloads/Data Assignment - Associate XYZ.csv")
df3 = pd.read_csv("C:/Users/Miracle/Downloads/Data Assignment - Associlate KLM.csv")

Add additonal column to each data set to uniquely differentiate rows where each data set is, this will increase readiability upon merging with other data sets

In [3]:
df1["Associate ABC"] = "Associate ABC"

In [4]:
df2["Associate ABC"] = "Associate XYZ"

In [5]:
df3["Associate ABC"] = "Associlate KLM"

Check to ensure all columns on the data sets are labeled correctly and make corrections where required

In [6]:
print(df1.columns)
print(df2.columns)
print(df3.columns)

Index(['Date', 'No of Leads', 'Time Spent on LG (in mins)', 'Associate ABC'], dtype='object')
Index(['Date', 'No of Leads', 'Time Spent on LG (in mins)', 'Associate ABC'], dtype='object')
Index(['Date', 'No of Leads', 'Time Spent on LG', 'Associate ABC'], dtype='object')

In [7]:
df3.rename(columns={"Time Spent on LG":"Time Spent on LG (in mins)"}, inplace = True)

Print first few rows of each data set, this to ensure compactability of the various data sets

In [8]:
print("FIRST FIVE ROWS OF DF1")
print(df1.head()) 
print()

print("FIRST FIVE ROWS OF DF12")
print(df2.head())
print()

print("FIRST FIVE ROWS OF DF13")
print(df3.head())

FIRST FIVE ROWS OF DF1
        Date  No of Leads  Time Spent on LG (in mins)  Associate ABC
0   9/1/2023          2.0                       300.0  Associate ABC
1  10/1/2023          1.0                       300.0  Associate ABC
2  11/1/2023          5.0                       300.0  Associate ABC
3  12/1/2023          4.0                       300.0  Associate ABC
4  13/1/2023          5.0                       300.0  Associate ABC

FIRST FIVE ROWS OF DF12
        Date  No of Leads  Time Spent on LG (in mins)  Associate ABC
0   9/1/2023         10.0                       180.0  Associate XYZ
1  10/1/2023         15.0                       300.0  Associate XYZ
2  11/1/2023         11.0                       300.0  Associate XYZ
3  12/1/2023         11.0                       300.0  Associate XYZ
4  13/1/2023         13.0                       300.0  Associate XYZ

FIRST FIVE ROWS OF DF13
        Date  No of Leads  Time Spent on LG (in mins)   Associate ABC
0   9/1/2023          6.0                       540.0  Associlate KLM
1  10/1/2023          9.0                       540.0  Associlate KLM
2  11/1/2023          NaN                         NaN  Associlate KLM
3  12/1/2023         11.0                       540.0  Associlate KLM
4  13/1/2023         16.0                       540.0  Associlate KLM

Merge the data sets <br>
Note:The merge data will take the column names of the first data set, as such make corrections if need be

In [9]:
data = pd.concat([df1,df2,df3], axis = 0)

In [10]:
data.head()

        Date  No of Leads  Time Spent on LG (in mins)  Associate ABC
0   9/1/2023          2.0                       300.0  Associate ABC
1  10/1/2023          1.0                       300.0  Associate ABC
2  11/1/2023          5.0                       300.0  Associate ABC
3  12/1/2023          4.0                       300.0  Associate ABC
4  13/1/2023          5.0                       300.0  Associate ABC

In [11]:
data.rename(columns={"Associate ABC":"Employee"}, inplace = True)

In [12]:
data.reset_index(drop=True, inplace=True)
data.head()

        Date  No of Leads  Time Spent on LG (in mins)       Employee
0   9/1/2023          2.0                       300.0  Associate ABC
1  10/1/2023          1.0                       300.0  Associate ABC
2  11/1/2023          5.0                       300.0  Associate ABC
3  12/1/2023          4.0                       300.0  Associate ABC
4  13/1/2023          5.0                       300.0  Associate ABC

In [13]:
data = data.dropna()

In [14]:
data.describe()

       No of Leads  Time Spent on LG (in mins)
count   196.000000                  196.000000
mean      9.250000                  375.969388
std       4.166256                  100.074737
min       0.000000                    0.000000
25%       6.000000                  300.000000
50%      10.000000                  360.000000
75%      12.250000                  420.000000
max      23.000000                  600.000000

In [15]:
data.describe(include = "all")

             Date  No of Leads  Time Spent on LG (in mins)        Employee
count         196   196.000000                  196.000000             196
unique        113          NaN                         NaN               3
top     27/1/2023          NaN                         NaN  Associlate KLM
freq            4          NaN                         NaN             107
mean          NaN     9.250000                  375.969388             NaN
std           NaN     4.166256                  100.074737             NaN
min           NaN     0.000000                    0.000000             NaN
25%           NaN     6.000000                  300.000000             NaN
50%           NaN    10.000000                  360.000000             NaN
75%           NaN    12.250000                  420.000000             NaN
max           NaN    23.000000                  600.000000             NaN